002_pipeInternalFlow/pipeInternalFlow_heatWallFlux_2Walls/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions    [ 0 0 0 1 0 0 0 ];
internalField    uniform 293.15;
boundaryField
{
	runwalls
	{
		type    fixedValue;
		value    uniform 293.15;
    }
	walls
	{
		type    externalWallHeatFluxTemperature;
		mode    flux;
		q    uniform 100;
		kappaMethod    fluidThermo;
		value    uniform 293.15;     
    }
	inlet
	{
		type    fixedValue;
		value    uniform 293.15;
	}

	outlet
	{
		type    zeroGradient;
	}
}



// ************************************************************************* //
