002_pipeInternalFlow/pipeInternalFlow_heatWallFlux_2Walls/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions    [ 0 1 -1 0 0 0 0 ];
internalField    uniform (0 0 0.3);
boundaryField
{
	runwalls
	{
		type    noSlip;
    }
	walls
	{
		type    noSlip;
	}

	inlet
	{
		type    fixedValue;
		value    uniform (0 0 0.3);
	}

	outlet
	{
		type            zeroGradient;
	}

}


// ************************************************************************* //
